电脑/python/其他内置模块/argparse模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-02-14 日 22:48 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>argparse模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">argparse模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. 简介</a>
<ul>
<li><a href="#orgheadline1">1.1. 简单添加一个参数</a></li>
<li><a href="#orgheadline3">1.2. 添加参数的其他选项设置</a>
<ul>
<li><a href="#orgheadline2">1.2.1. nargs选项设置</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline5">2. 一个完整的例子</a></li>
<li><a href="#orgheadline8">3. 命令行选项关联其他动作</a>
<ul>
<li><a href="#orgheadline6">3.1. store_const</a></li>
<li><a href="#orgheadline7">3.2. store_true 和 store_false</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline4">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
一般制作python命令行脚本，推荐使用argparse模块，
</p>

<p>
下面简要介绍了python3的官方文档argparse模块的用法，用于快速制作一个可以刷参数的python脚本，更多信息请参看 <a href="https://docs.python.org/3/library/argparse.html">官方文档</a> 。
</p>

<p>
首先看下面这个简单的情况:
</p>
<div class="highlight"><pre><span class="kn">import</span> <span class="nn">argparse</span>
<span class="n">usage</span> <span class="o">=</span> <span class="s">&#39;&#39;&#39;</span>
<span class="s">this is a example to show argparse usage</span>
<span class="s">&#39;&#39;&#39;</span>
<span class="n">parser</span> <span class="o">=</span> <span class="n">argparse</span><span class="o">.</span><span class="n">ArgumentParser</span><span class="p">(</span><span class="n">usage</span><span class="o">=</span><span class="n">usage</span><span class="p">)</span>

<span class="n">args</span> <span class="o">=</span> <span class="n">parser</span><span class="o">.</span><span class="n">parse_args</span><span class="p">()</span>
</pre></div>

<p>
这是简单的一个例子了，现在脚本还不可以接受任何参数，只可以用 <code>-h</code> 或 <code>--help</code> 来查看一些信息，如下所示。
</p>
<pre>
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py -h
usage: 
this is a example to show argparse usage
 [-h]

optional arguments:
  -h, --help  show this help message and exit
</pre>

<p>
其首先是新建一个parser，上面ArgumentParser的usage是可选参数，就是命令行的一些描述信息。然后需要调用parser的 <code>parse_args</code> 方法，其就是具体将命令行接受的一些参数刷进去。
</p>
</div>


<div class="outline-3">
<h3 id="orgheadline1">简单添加一个参数</h3>
<div class="outline-text-3" id="text-1-1">
<p>
上面的例子太简单了，现在开始简单添加一个参数。
</p>
<pre>
import argparse
usage = '''
this is a example to show argparse usage
'''
parser = argparse.ArgumentParser(usage=usage)

parser.add_argument('--config',help="the config file path")

args = parser.parse_args()

print(args)
</pre>
<p>
这样命令行的帮助信息就变成如下所示了:
</p>

<pre>
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py -h
usage: 
this is a example to show argparse usage

optional arguments:
  -h, --help       show this help message and exit
  --config CONFIG  the config file path
</pre>

<p>
如果我们如下输入则有:
</p>
<pre>
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py --config='config.cfg'
Namespace(config='config.cfg')
</pre>

<p>
我们看到 <code>parse_args</code> 方法返回的是Namespace对象，推荐用 <code>vars</code> 函数来将其处理成为字典值，这样会更好地方便后面的使用。
</p>

<div class="highlight"><pre><span class="kn">import</span> <span class="nn">argparse</span>
<span class="n">usage</span> <span class="o">=</span> <span class="s">&#39;&#39;&#39;</span>
<span class="s">this is a example to show argparse usage</span>
<span class="s">&#39;&#39;&#39;</span>
<span class="n">parser</span> <span class="o">=</span> <span class="n">argparse</span><span class="o">.</span><span class="n">ArgumentParser</span><span class="p">(</span><span class="n">usage</span><span class="o">=</span><span class="n">usage</span><span class="p">)</span>
<span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;-c&#39;</span><span class="p">,</span><span class="s">&#39;--config&#39;</span><span class="p">,</span><span class="n">help</span><span class="o">=</span><span class="s">&quot;the config file path&quot;</span><span class="p">)</span>
<span class="n">args</span> <span class="o">=</span> <span class="nb">vars</span><span class="p">(</span><span class="n">parser</span><span class="o">.</span><span class="n">parse_args</span><span class="p">())</span>

<span class="k">print</span><span class="p">(</span><span class="n">args</span><span class="p">)</span>
</pre></div>

<pre>
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py -h
usage: 
this is a example to show argparse usage
python3 hello.py

optional arguments:
  -h, --help            show this help message and exit
  -c CONFIG, --config CONFIG
                        the config file path
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py --config='config.cfg'
{'config': 'config.cfg'}
</pre>

<p>
上面代码稍作修改，在长名字可选参数前面还可以加上短名字可选参数支持，然后我们看到 <code>parse_args</code> 方法经过 <code>vars</code> 处理之后返回的是字典值。该字典的key默认对应的是长名字可选参数。你还可以自己设置目标参数名:
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline3">添加参数的其他选项设置</h3>
<div class="outline-text-3" id="text-1-2">
<p>
下面演示了如何设置目标参数在脚本中具体对应的变量名:
</p>
<div class="highlight"><pre><span class="kn">import</span> <span class="nn">argparse</span>
<span class="n">usage</span> <span class="o">=</span> <span class="s">&#39;&#39;&#39;</span>
<span class="s">this is a example to show argparse usage</span>
<span class="s">&#39;&#39;&#39;</span>
<span class="n">parser</span> <span class="o">=</span> <span class="n">argparse</span><span class="o">.</span><span class="n">ArgumentParser</span><span class="p">(</span><span class="n">usage</span><span class="o">=</span><span class="n">usage</span><span class="p">)</span>
<span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;-c&#39;</span><span class="p">,</span><span class="s">&#39;--config&#39;</span><span class="p">,</span><span class="n">dest</span><span class="o">=</span><span class="s">&quot;configpath&quot;</span><span class="p">,</span><span class="n">help</span><span class="o">=</span><span class="s">&quot;the config file path&quot;</span><span class="p">)</span>
<span class="n">args</span> <span class="o">=</span> <span class="nb">vars</span><span class="p">(</span><span class="n">parser</span><span class="o">.</span><span class="n">parse_args</span><span class="p">())</span>

<span class="k">print</span><span class="p">(</span><span class="n">args</span><span class="p">)</span>
</pre></div>

<p>
然后我们看到字典输入如下:
</p>
<pre>
wanze@wanze-ubuntu64:~/桌面$ python3 hello.py --config='config.cfg'
{'configpath': 'config.cfg'}
</pre>

<p>
当然一般就默认设置成为和长名字可选参数一致，没必要这么折腾。类似的你还可以继续用 <code>add_argument</code> 方法来添加其他的可选参数，然后 <code>add_argument</code> 还有如下一些选项配置:
</p>

<dl class="org-dl">
<dt>required=True</dt><dd>该参数一定要输入值，否则报错</dd>
<dt>help</dt><dd>描述信息，前面已经看到了。</dd>
<dt>default</dt><dd>该参数的默认值，默认是None，你可以选择设置成另外一个值。</dd>
<dt>type</dt><dd>目标参数的数据类型，默认是字符串，可以设置为int或float。注意设置格式如下，不是字符串的那种设置形式:</dd>
</dl>
<pre>
parser.add_argument('--delay',type=int)
</pre>


<p>
必填参数的添加如下所示，除了这个"target"名字前面没有 <code>--</code> 之外，和可选参数用法大致类似，其刷入args字典之后的key就是"target"这个名字。
</p>
<pre>
parser.add_argument('target',help="必填参数")
</pre>

<p>
不过必填参数和可选参数在某些细节上还是有点差异的，后面会提及。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline2">nargs选项设置</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
nargs设置之后该参数在脚本中具体对应的变量将是一个列表。其中nargs可以设置为一个数字，比如 <code>nargs=4</code> ，则脚本对该参数将接受4个输入值，然后将其收集进一个列表里面。
</p>

<p>
此外还有:
</p>
<dl class="org-dl">
<dt>nargs='*'</dt><dd>这通常是对可选参数进行设置，当然也可以作用于必填参数，但这让必填参数失去意义了。其将收集任意多的输入参数值，而如果多个可选参数之间这样使用星号是可以的，具体如官方文档所述:</dd>
</dl>
<pre>
&gt;&gt;&gt; parser = argparse.ArgumentParser()
&gt;&gt;&gt; parser.add_argument('--foo', nargs='*')
&gt;&gt;&gt; parser.add_argument('--bar', nargs='*')
&gt;&gt;&gt; parser.add_argument('baz', nargs='*')
&gt;&gt;&gt; parser.parse_args('a b --foo x y --bar 1 2'.split())
Namespace(bar=['1', '2'], baz=['a', 'b'], foo=['x', 'y'])
</pre>

<dl class="org-dl">
<dt>nargs='+'</dt><dd>这通常作用于必填参数，其意义有点类似于正则表达式里面的'+'号，和上面的'*'号比起来其必须有一个输入值，否则将报错。</dd>

<dt>nargs='?'</dt><dd>这个'?'号具体使用情况挺复杂的，我不太喜欢，而且其和nargs其他的一些设置比较起来显得有点格格不入。首先其对应的变量值不是列表而是单个值！其次其改变了默认值的行为。如果该参数不输入，比如 <code>--foo</code> 这个东西完全不输入在命令行里面，那么foo默认取default的值，如果加入了 <code>--foo</code> 这个东西但是后面又不跟值，则foo取 <strong>const</strong> 选项赋的值。不太喜欢这个东西。</dd>
</dl>
</div>
</div>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline5">一个完整的例子</h2>
<div class="outline-text-2" id="text-2">
<p>
下面给出一个完整的例子:
</p>
<div class="highlight"><pre><span class="c">#!/usr/bin/env python3</span>
<span class="c"># -*- coding: utf-8 -*-</span>

<span class="kn">import</span> <span class="nn">argparse</span>
<span class="n">usage</span> <span class="o">=</span> <span class="s">&#39;&#39;&#39;</span>
<span class="s">resize the image</span>
<span class="s">&#39;&#39;&#39;</span>

<span class="k">def</span> <span class="nf">main</span><span class="p">():</span>
    <span class="n">parser</span> <span class="o">=</span> <span class="n">argparse</span><span class="o">.</span><span class="n">ArgumentParser</span><span class="p">(</span><span class="n">usage</span><span class="o">=</span><span class="n">usage</span><span class="p">)</span>
    <span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;-c&#39;</span><span class="p">,</span><span class="s">&#39;--config&#39;</span><span class="p">,</span><span class="n">dest</span><span class="o">=</span><span class="s">&quot;configpath&quot;</span><span class="p">,</span><span class="n">help</span><span class="o">=</span><span class="s">&quot;the config file path&quot;</span><span class="p">)</span>
    <span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;inputimg&#39;</span><span class="p">,</span><span class="n">help</span><span class="o">=</span><span class="s">&quot;the input image&quot;</span><span class="p">,</span><span class="n">nargs</span><span class="o">=</span><span class="s">&#39;+&#39;</span><span class="p">)</span>
    <span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;--width&#39;</span><span class="p">,</span><span class="n">help</span><span class="o">=</span><span class="s">&quot;the input image&quot;</span><span class="p">,</span><span class="nb">type</span><span class="o">=</span><span class="nb">int</span><span class="p">)</span>

    <span class="n">args</span> <span class="o">=</span> <span class="nb">vars</span><span class="p">(</span><span class="n">parser</span><span class="o">.</span><span class="n">parse_args</span><span class="p">())</span>

    <span class="n">configpath</span> <span class="o">=</span> <span class="n">args</span><span class="p">[</span><span class="s">&#39;configpath&#39;</span><span class="p">]</span>
    <span class="n">width</span> <span class="o">=</span> <span class="n">args</span><span class="p">[</span><span class="s">&#39;width&#39;</span><span class="p">]</span>
    <span class="n">inputimg</span> <span class="o">=</span> <span class="n">args</span><span class="p">[</span><span class="s">&#39;inputimg&#39;</span><span class="p">]</span>

    <span class="k">for</span> <span class="n">inputimg</span> <span class="ow">in</span> <span class="n">args</span><span class="p">[</span><span class="s">&#39;inputimg&#39;</span><span class="p">]:</span>
        <span class="k">print</span><span class="p">(</span><span class="s">&#39;resize image&#39;</span><span class="p">)</span>
        <span class="k">print</span><span class="p">(</span><span class="s">&#39;the input image is {}&#39;</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">inputimg</span><span class="p">))</span>
        <span class="k">print</span><span class="p">(</span><span class="s">&#39;the target width is {}&#39;</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">width</span><span class="p">))</span>


<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">main</span><span class="p">()</span>
</pre></div>


<p>
具体运行情况如下所示:
</p>
<pre>
wanze@wanze-ubuntu64:~/图片$ python3 resizeimg.py --help
usage: 
resize the image

positional arguments:
  inputimg              the input image

optional arguments:
  -h, --help            show this help message and exit
  -c CONFIGPATH, --config CONFIGPATH
                        the config file path
  --width WIDTH         the input image
</pre>

<pre>
wanze@wanze-ubuntu64:~/图片$ python3 resizeimg.py --width=300 *.png
resize image
the input image is 2015-01-27 13:16:46 的屏幕截图.png
the target width is 300
resize image
the input image is 2015-05-03 18:17:19屏幕截图.png
the target width is 300
resize image
the input image is 2015-05-03 18:20:45屏幕截图.png
the target width is 300
....
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline8">命令行选项关联其他动作</h2>
<div class="outline-text-2" id="text-3">
<p>
parser的 <code>add_argument</code> 方法的 <code>action</code> 参数就是用来控制命令行选项关联的动作的，一般都不需要设置，就是默认的 <code>store</code> ，也就是存储值。类似的有 <code>store_const</code> , <code>store_true</code> 和 <code>store_false</code> 。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline6">store_const</h3>
<div class="outline-text-3" id="text-3-1">
<p>
如果是默认的store，则通常是需要指明具体值的，如果设置action为store_const了:
</p>
<div class="highlight"><pre><span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;--foo&#39;</span><span class="p">,</span> <span class="n">action</span><span class="o">=</span><span class="s">&#39;store_const&#39;</span><span class="p">,</span> <span class="n">const</span><span class="o">=</span><span class="mi">42</span><span class="p">)</span>
</pre></div>

<p>
那么如下就会自动设置该值，这和default默认值的区别是这个选项的值要求是某个常量值。
</p>
<pre>
&gt;&gt; python3 test2.py --foo
Namespace(foo=42)
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">store_true 和 store_false</h3>
<div class="outline-text-3" id="text-3-2">
<p>
如果写为:
</p>
<div class="highlight"><pre><span class="n">parser</span><span class="o">.</span><span class="n">add_argument</span><span class="p">(</span><span class="s">&#39;--foo&#39;</span><span class="p">,</span> <span class="n">action</span><span class="o">=</span><span class="s">&#39;store_true&#39;</span><span class="p">)</span>
</pre></div>
<p>
则其存储的就是 <code>True</code> 值:
</p>
<pre>
&gt;&gt; python3 test2.py --foo 
Namespace(foo=True)
</pre>

<p>
这里主要是要讲定义自己的动作，就是类似 <code>--version</code> 这样的用法，是一种影响程序整个工作流的选项，官方文档推荐通过子类化 <code>argparse.Action</code> 的方法，还是有点麻烦的。然后发现 <code>click</code> 模块非常好，处理这个问题也很容易:
</p>

<div class="highlight"><pre><span class="kn">import</span> <span class="nn">click</span>

<span class="k">def</span> <span class="nf">print_version</span><span class="p">(</span><span class="n">ctx</span><span class="p">,</span> <span class="n">param</span><span class="p">,</span> <span class="n">value</span><span class="p">):</span>
    <span class="k">if</span> <span class="ow">not</span> <span class="n">value</span> <span class="ow">or</span> <span class="n">ctx</span><span class="o">.</span><span class="n">resilient_parsing</span><span class="p">:</span>
        <span class="k">return</span>
    <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="s">&#39;Version 1.0&#39;</span><span class="p">)</span>
    <span class="n">ctx</span><span class="o">.</span><span class="n">exit</span><span class="p">()</span>

<span class="k">def</span> <span class="nf">quick</span><span class="p">(</span><span class="n">ctx</span><span class="p">,</span><span class="n">param</span><span class="p">,</span><span class="n">value</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="n">ctx</span><span class="p">,</span><span class="n">param</span><span class="p">,</span><span class="n">value</span><span class="p">)</span>
    <span class="n">ctx</span><span class="o">.</span><span class="n">exit</span><span class="p">()</span>

<span class="nd">@click.command</span><span class="p">()</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s">&#39;--version&#39;</span><span class="p">,</span> <span class="n">is_flag</span><span class="o">=</span><span class="bp">True</span><span class="p">,</span> <span class="n">callback</span><span class="o">=</span><span class="n">print_version</span><span class="p">,</span>
              <span class="n">expose_value</span><span class="o">=</span><span class="bp">False</span><span class="p">,</span> <span class="n">is_eager</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>
<span class="nd">@click.option</span><span class="p">(</span><span class="s">&#39;--quick&#39;</span><span class="p">,</span><span class="n">callback</span><span class="o">=</span><span class="n">quick</span><span class="p">,</span><span class="n">is_flag</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">():</span>
    <span class="k">while</span> <span class="bp">True</span><span class="p">:</span>
        <span class="n">userinput</span> <span class="o">=</span> <span class="nb">input</span><span class="p">(</span><span class="s">&#39;input:&#39;</span><span class="p">)</span>
        <span class="n">click</span><span class="o">.</span><span class="n">echo</span><span class="p">(</span><span class="n">userinput</span><span class="p">)</span>

        <span class="k">if</span> <span class="n">userinput</span> <span class="o">==</span> <span class="s">&#39;exit&#39;</span><span class="p">:</span>
            <span class="k">break</span>


<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">hello</span><span class="p">()</span>
</pre></div>

<p>
这里的ctx和param到click模块那边再细将吧，我们看到整个过程比argparse美观多了。
</p>
</div>
</div>
</div>
</div>
</body>
</html>
